### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_integer.num will be created
+   resource "random_integer" "num" {
+       id     = (known after apply)
+       max    = 9999
+       min    = 1
+       result = (known after apply)
    }

  # module.dynamic-subnets-test.azurerm_resource_group.core_network_rg[0] will be created
+   resource "azurerm_resource_group" "core_network_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = (known after apply)
+       tags     = {
+           "Description" = "This is a demo built with Terraform"
+           "Purpose"     = "Terraform-Core-Networking-Development"
+           "Terraform"   = "True"
        }
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dev.10.2.2.0/24"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.2.2.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Dev"
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = (known after apply)
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dmz1.10.2.0.0/25"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.2.0.0/25",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Dmz1"
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = (known after apply)
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Dmz2.10.2.0.128/25"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.2.0.128/25",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Dmz2"
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = (known after apply)
    }

  # module.dynamic-subnets-test.azurerm_subnet.dynamic["Prod.10.2.1.0/24"] will be created
+   resource "azurerm_subnet" "dynamic" {
+       address_prefix                                 = (known after apply)
+       address_prefixes                               = [
+           "10.2.1.0/24",
        ]
+       enforce_private_link_endpoint_network_policies = false
+       enforce_private_link_service_network_policies  = false
+       id                                             = (known after apply)
+       name                                           = "Prod"
+       resource_group_name                            = (known after apply)
+       virtual_network_name                           = (known after apply)
    }

  # module.dynamic-subnets-test.azurerm_virtual_network.core_vnet[0] will be created
+   resource "azurerm_virtual_network" "core_vnet" {
+       address_space         = [
+           "10.2.0.0/22",
        ]
+       dns_servers           = []
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       location              = "uksouth"
+       name                  = (known after apply)
+       resource_group_name   = (known after apply)
+       subnet                = (known after apply)
+       tags                  = {
+           "Description" = "This is a demo built with Terraform"
+           "Purpose"     = "Terraform-Core-Vnet-Development"
+           "Terraform"   = "True"
        }
+       vm_protection_enabled = false
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
</details>